tiborsimon/embedded-tdd-headers/pic/pic16/pic16lf1554_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC16LF1554_H_
#define _PIC16LF1554_H_

#define INDF0                         0
#define INDF1                         1
#define PCL                           2
#define STATUS                        3
#define C                             4
#define CARRY                         5
#define DC                            6
#define ZERO                          7
#define Z                             8
#define nPD                           9
#define nTO                           10
#define FSR0L                         11
#define FSR0H                         12
#define FSR1L                         13
#define FSR1H                         14
#define BSR                           15
#define BSR0                          16
#define BSR1                          17
#define BSR2                          18
#define BSR3                          19
#define BSR4                          20
#define WREG                          21
#define WREG0                         22
#define PCLATH                        23
#define INTCON                        24
#define IOCIF                         25
#define INTF                          26
#define T0IF                          27
#define TMR0IF                        28
#define IOCIE                         29
#define INTE                          30
#define T0IE                          31
#define TMR0IE                        32
#define PEIE                          33
#define GIE                           34
#define PORTA                         35
#define RA0                           36
#define RA1                           37
#define RA2                           38
#define RA3                           39
#define RA4                           40
#define RA5                           41
#define PORTC                         42
#define RC0                           43
#define RC1                           44
#define RC2                           45
#define RC3                           46
#define RC4                           47
#define RC5                           48
#define PIR1                          49
#define TMR1IF                        50
#define TMR2IF                        51
#define SSP1IF                        52
#define TXIF                          53
#define RCIF                          54
#define AD1IF                         55
#define ADIF                          56
#define TMR1GIF                       57
#define PIR2                          58
#define BCL1IF                        59
#define AD2IF                         60
#define TMR0                          61
#define TMR1L                         62
#define TMR1H                         63
#define T1CON                         64
#define TMR1ON                        65
#define nT1SYNC                       66
#define T1CKPS0                       67
#define T1CKPS                        68
#define T1CKPS1                       69
#define TMR1CS0                       70
#define TMR1CS                        71
#define TMR1CS1                       72
#define T1GCON                        73
#define T1GSS0                        74
#define T1GSS                         75
#define T1GSS1                        76
#define T1GVAL                        77
#define T1GGO_nDONE                   78
#define T1GCON_GO                     79
#define T1GSPM                        80
#define T1GTM                         81
#define T1GPOL                        82
#define TMR1GE                        83
#define TMR2                          84
#define PR2                           85
#define T2CON                         86
#define T2CKPS0                       87
#define T2CKPS                        88
#define T2CKPS1                       89
#define TMR2ON                        90
#define T2OUTPS0                      91
#define T2OUTPS                       92
#define T2OUTPS1                      93
#define T2OUTPS2                      94
#define T2OUTPS3                      95
#define TRISA                         96
#define TRISA0                        97
#define TRISA1                        98
#define TRISA2                        99
#define TRISA3                        100
#define TRISA4                        101
#define TRISA5                        102
#define TRISC                         103
#define TRISC0                        104
#define TRISC1                        105
#define TRISC2                        106
#define TRISC3                        107
#define TRISC4                        108
#define TRISC5                        109
#define PIE1                          110
#define TMR1IE                        111
#define TMR2IE                        112
#define SSP1IE                        113
#define TXIE                          114
#define RCIE                          115
#define AD1IE                         116
#define ADIE                          117
#define TMR1GIE                       118
#define PIE2                          119
#define BCL1IE                        120
#define AD2IE                         121
#define OPTION_REG                    122
#define PS                            123
#define PS0                           124
#define PS1                           125
#define PS2                           126
#define PSA                           127
#define T0SE                          128
#define TMR0SE                        129
#define T0CS                          130
#define TMR0CS                        131
#define INTEDG                        132
#define nWPUEN                        133
#define PCON                          134
#define nBOR                          135
#define nPOR                          136
#define nRI                           137
#define nRMCLR                        138
#define nRWDT                         139
#define STKUNF                        140
#define STKOVF                        141
#define WDTCON                        142
#define SWDTEN                        143
#define WDTPS                         144
#define WDTPS0                        145
#define WDTPS1                        146
#define WDTPS2                        147
#define WDTPS3                        148
#define WDTPS4                        149
#define OSCCON                        150
#define SCS0                          151
#define SCS                           152
#define SCS1                          153
#define IRCF                          154
#define IRCF0                         155
#define IRCF1                         156
#define IRCF2                         157
#define IRCF3                         158
#define SPLLEN                        159
#define OSCSTAT                       160
#define HFIOFS                        161
#define LFIOFR                        162
#define HFIOFR                        163
#define PLLSR                         164
#define ADRESL                        165
#define ADRESL_ADRESL                 166
#define ADRESH                        167
#define ADRESH_ADRESH                 168
#define ADCON0                        169
#define AD1ON                         170
#define ADCON0_ADON                   171
#define ADCON0_GO_nDONE               172
#define ADCON0_GO                     173
#define ADGO                          174
#define ADCON0_CHS                    175
#define ADCON0_CHS0                   176
#define ADCON0_CHS1                   177
#define ADCON0_CHS2                   178
#define ADCON0_CHS3                   179
#define ADCON0_CHS4                   180
#define ADCON1                        181
#define ADCON1_ADPREF                 182
#define ADCON1_ADPREF0                183
#define ADCON1_ADPREF1                184
#define ADCON1_GO_nDONE_ALL           185
#define ADCON1_GO_ALL                 186
#define ADCON1_ADCS                   187
#define ADCON1_ADFM                   188
#define ADCON2                        189
#define ADCON2_TRIGSEL0               190
#define ADCON2_TRIGSEL                191
#define ADCON2_TRIGSEL1               192
#define ADCON2_TRIGSEL2               193
#define LATA                          194
#define LATA0                         195
#define LATA1                         196
#define LATA2                         197
#define LATA4                         198
#define LATA5                         199
#define LATC                          200
#define LATC0                         201
#define LATC1                         202
#define LATC2                         203
#define LATC3                         204
#define LATC4                         205
#define LATC5                         206
#define BORCON                        207
#define BORRDY                        208
#define BORFS                         209
#define SBOREN                        210
#define FVRCON                        211
#define ADFVR0                        212
#define ADFVR                         213
#define ADFVR1                        214
#define CDAFVR0                       215
#define CDAFVR1                       216
#define TSRNG                         217
#define TSEN                          218
#define FVRRDY                        219
#define FVREN                         220
#define APFCON                        221
#define GRDASEL                       222
#define GRDBSEL                       223
#define TXCKSEL                       224
#define SDSEL                         225
#define SSSEL                         226
#define SDOSEL                        227
#define RXDTSEL                       228
#define ANSA0                         229
#define ANSELA                        230
#define ANSA1                         231
#define ANSA2                         232
#define ANSA4                         233
#define ANSA5                         234
#define ANSC0                         235
#define ANSELC                        236
#define ANSC1                         237
#define ANSC2                         238
#define ANSC3                         239
#define ANSC4                         240
#define ANSC5                         241
#define PMADRL                        242
#define PMADRH                        243
#define PMDATL                        244
#define PMDATH                        245
#define PMCON1                        246
#define RD                            247
#define WR                            248
#define WREN                          249
#define WRERR                         250
#define FREE                          251
#define LWLO                          252
#define CFGS                          253
#define PMCON2                        254
#define RCREG                         255
#define TXREG                         256
#define SPBRGL                        257
#define SPBRGH                        258
#define RCSTA                         259
#define RX9D                          260
#define OERR                          261
#define FERR                          262
#define ADDEN                         263
#define CREN                          264
#define SREN                          265
#define RX9                           266
#define SPEN                          267
#define TXSTA                         268
#define TX9D                          269
#define TRMT                          270
#define BRGH                          271
#define SENDB                         272
#define SYNC                          273
#define TXEN                          274
#define TX9                           275
#define CSRC                          276
#define BAUDCON                       277
#define ABDEN                         278
#define WUE                           279
#define BRG16                         280
#define SCKP                          281
#define RCIDL                         282
#define ABDOVF                        283
#define WPUA0                         284
#define WPUA                          285
#define WPUA1                         286
#define WPUA2                         287
#define WPUA3                         288
#define WPUA4                         289
#define WPUA5                         290
#define SSP1BUF                       291
#define SSPBUF                        292
#define SSP1ADD                       293
#define ADD                           294
#define SSP1MSK                       295
#define MSK                           296
#define SSP1STAT                      297
#define BF                            298
#define UA                            299
#define R_nW                          300
#define S                             301
#define P                             302
#define D_nA                          303
#define CKE                           304
#define SMP                           305
#define SSP1CON1                      306
#define SSPM0                         307
#define SSPM                          308
#define SSPM1                         309
#define SSPM2                         310
#define SSPM3                         311
#define CKP                           312
#define SSPEN                         313
#define SSPOV                         314
#define WCOL                          315
#define SSP1CON2                      316
#define SEN                           317
#define RSEN                          318
#define PEN                           319
#define RCEN                          320
#define ACKEN                         321
#define ACKDT                         322
#define ACKSTAT                       323
#define GCEN                          324
#define SSP1CON3                      325
#define DHEN                          326
#define AHEN                          327
#define SBCDE                         328
#define SDAHT                         329
#define BOEN                          330
#define SCIE                          331
#define PCIE                          332
#define ACKTIM                        333
#define IOCAP                         334
#define IOCAP0                        335
#define IOCAP1                        336
#define IOCAP2                        337
#define IOCAP3                        338
#define IOCAP4                        339
#define IOCAP5                        340
#define IOCAN0                        341
#define IOCAN                         342
#define IOCAN1                        343
#define IOCAN2                        344
#define IOCAN3                        345
#define IOCAN4                        346
#define IOCAN5                        347
#define IOCAF0                        348
#define IOCAF                         349
#define IOCAF1                        350
#define IOCAF2                        351
#define IOCAF3                        352
#define IOCAF4                        353
#define IOCAF5                        354
#define PWM1DCL                       355
#define PWM1DCL0                      356
#define PWM1DCL1                      357
#define PWM1DCH                       358
#define PWM1DCH0                      359
#define PWM1DCH1                      360
#define PWM1DCH2                      361
#define PWM1DCH3                      362
#define PWM1DCH4                      363
#define PWM1DCH5                      364
#define PWM1DCH6                      365
#define PWM1DCH7                      366
#define PWM1CON                       367
#define PWM1POL                       368
#define PWM1OUT                       369
#define PWM1OE                        370
#define PWM1EN                        371
#define PWM2DCL0                      372
#define PWM2DCL                       373
#define PWM2DCL1                      374
#define PWM2DCH0                      375
#define PWM2DCH                       376
#define PWM2DCH1                      377
#define PWM2DCH2                      378
#define PWM2DCH3                      379
#define PWM2DCH4                      380
#define PWM2DCH5                      381
#define PWM2DCH6                      382
#define PWM2DCH7                      383
#define PWM2CON                       384
#define PWM2POL                       385
#define PWM2OUT                       386
#define PWM2OE                        387
#define PWM2EN                        388
#define AD1CON0                       389
#define AD1CON0_ADON                  390
#define AD1CON0_GO                    391
#define GO_nDONE1                     392
#define AD1CON0_GO_nDONE              393
#define AD1CON0_CHS0                  394
#define AD1CON0_CHS                   395
#define AD1CON0_CHS1                  396
#define AD1CON0_CHS2                  397
#define AD1CON0_CHS3                  398
#define AD1CON0_CHS4                  399
#define ADCOMCON                      400
#define ADCOMCON_ADPREF               401
#define ADCOMCON_ADPREF0              402
#define ADCOMCON_ADPREF1              403
#define ADCOMCON_GO_nDONE_ALL         404
#define ADCOMCON_GO_ALL               405
#define ADCS0                         406
#define ADCOMCON_ADCS                 407
#define ADCS1                         408
#define ADCS2                         409
#define ADCOMCON_ADFM                 410
#define AD1CON2                       411
#define AD1CON2_TRIGSEL               412
#define AD1CON2_TRIGSEL0              413
#define AD1CON2_TRIGSEL1              414
#define AD1CON2_TRIGSEL2              415
#define AD1CON3                       416
#define AD1DSEN                       417
#define AD1CON3_ADDSEN                418
#define AD1IPEN                       419
#define AD1CON3_ADIPEN                420
#define AD1CON3_ADIPPOL               421
#define AD1IPPOL                      422
#define AD1EPPOL                      423
#define AD1CON3_ADEPPOL               424
#define ADSTAT                        425
#define AD1STG0                       426
#define ADSTG                         427
#define AD1STG                        428
#define AD1STG1                       429
#define AD1CONV                       430
#define ADCONV                        431
#define AD2STG0                       432
#define AD2STG                        433
#define AD2STG1                       434
#define AD2CONV                       435
#define AD1PRECON                     436
#define AD1PRECON_ADPRE               437
#define AD1PRECON_ADPRE0              438
#define AD1PRECON_ADPRE1              439
#define AD1PRECON_ADPRE2              440
#define AD1PRECON_ADPRE3              441
#define AD1PRECON_ADPRE4              442
#define AD1PRECON_ADPRE5              443
#define AD1PRECON_ADPRE6              444
#define AD1ACQCON                     445
#define AD1ACQCON_ADACQ0              446
#define AD1ACQCON_ADACQ               447
#define AD1ACQCON_ADACQ1              448
#define AD1ACQCON_ADACQ2              449
#define AD1ACQCON_ADACQ3              450
#define AD1ACQCON_ADACQ4              451
#define AD1ACQCON_ADACQ5              452
#define AD1ACQCON_ADACQ6              453
#define AD1GRD                        454
#define GRD1POL                       455
#define AD1GRD_GRDPOL                 456
#define AD1GRD_GRDAOE                 457
#define GRD1AOE                       458
#define AD1GRD_GRDBOE                 459
#define GRD1BOE                       460
#define AD1CAPCON                     461
#define AD1CAPCON_ADDCAP              462
#define ADD1CAP                       463
#define AD1CAPCON_ADDCAP0             464
#define AD1CAPCON_ADCAP               465
#define AD1CAPCON_ADDCAP1             466
#define AD1CAPCON_ADDCAP2             467
#define AD1CAPCON_ADDCAP3             468
#define AAD1RES0L                     469
#define AAD1RES0L_ADRESL              470
#define AAD1RES0H                     471
#define AAD1RES0H_ADRESH              472
#define AAD1RES1L                     473
#define AAD1RES1L_ADRESL              474
#define AAD1RES1H                     475
#define AAD1RES1H_ADRESH              476
#define AD1CH                         477
#define CH10                          478
#define CH11                          479
#define CH12                          480
#define CH13                          481
#define AD2CON0                       482
#define AD2CON0_ADON                  483
#define GO_nDONE2                     484
#define AD2CON0_GO                    485
#define AD2CON0_GO_nDONE              486
#define AD2CON0_CHS                   487
#define AD2CON0_CHS0                  488
#define AD2CON0_CHS1                  489
#define AD2CON0_CHS2                  490
#define AD2CON0_CHS3                  491
#define AD2CON0_CHS4                  492
#define AD2CON2                       493
#define AD2CON2_TRIGSEL0              494
#define AD2CON2_TRIGSEL               495
#define AD2CON2_TRIGSEL1              496
#define AD2CON2_TRIGSEL2              497
#define AD2CON3                       498
#define AD2CON3_ADDSEN                499
#define AD2DSEN                       500
#define AD2IPEN                       501
#define AD2CON3_ADIPEN                502
#define AD2IPPOL                      503
#define AD2CON3_ADIPPOL               504
#define AD2CON3_ADEPPOL               505
#define AD2EPPOL                      506
#define AD2PRECON                     507
#define AD2PRECON_ADPRE0              508
#define AD2PRECON_ADPRE               509
#define AD2PRECON_ADPRE1              510
#define AD2PRECON_ADPRE2              511
#define AD2PRECON_ADPRE3              512
#define AD2PRECON_ADPRE4              513
#define AD2PRECON_ADPRE5              514
#define AD2PRECON_ADPRE6              515
#define AD2ACQCON                     516
#define AD2ACQCON_ADACQ0              517
#define AD2ACQCON_ADACQ               518
#define AD2ACQCON_ADACQ1              519
#define AD2ACQCON_ADACQ2              520
#define AD2ACQCON_ADACQ3              521
