tiborsimon/embedded-tdd-headers/pic/pic16/pic16lf1554_tdd.h
#define AD2ACQCON_ADACQ4              522
#define AD2ACQCON_ADACQ5              523
#define AD2ACQCON_ADACQ6              524
#define AD2GRD                        525
#define AD2GRD_GRDPOL                 526
#define GRD2POL                       527
#define AD2GRD_GRDAOE                 528
#define GRD2AOE                       529
#define GRD2BOE                       530
#define AD2GRD_GRDBOE                 531
#define AD2CAPCON                     532
#define AD2CAPCON_ADDCAP              533
#define AD2CAPCON_ADCAP               534
#define ADD2CAP                       535
#define AD2CAPCON_ADDCAP0             536
#define AD2CAPCON_ADDCAP1             537
#define AD2CAPCON_ADDCAP2             538
#define AD2CAPCON_ADDCAP3             539
#define AAD2RES0L                     540
#define AAD2RES0L_ADRESL              541
#define AAD2RES0H                     542
#define AAD2RES0H_ADRESH              543
#define AAD2RES1L                     544
#define AAD2RES1L_ADRESL              545
#define AAD2RES1H                     546
#define AAD2RES1H_ADRESH              547
#define AD2CH                         548
#define CH20                          549
#define CH21                          550
#define CH22                          551
#define CH23                          552
#define ICDIO                         553
#define TRIS_ICDCLK                   554
#define TRIS_ICDDAT                   555
#define LAT_ICDCLK                    556
#define LAT_ICDDAT                    557
#define PORT_ICDCLK                   558
#define PORT_ICDDAT                   559
#define ICDCON0                       560
#define RSTVEC                        561
#define DBGINEX                       562
#define SSTEP                         563
#define FREEZ                         564
#define INBUG                         565
#define ICDSTAT                       566
#define USRHLTF                       567
#define TRP0HLTF                      568
#define TRP1HLTF                      569
#define ICDINSTL                      570
#define DBGIN0                        571
#define DBGIN1                        572
#define DBGIN2                        573
#define DBGIN3                        574
#define DBGIN4                        575
#define DBGIN5                        576
#define DBGIN6                        577
#define DBGIN7                        578
#define ICDINSTH                      579
#define DBGIN8                        580
#define DBGIN9                        581
#define DBGIN10                       582
#define DBGIN11                       583
#define DBGIN12                       584
#define DBGIN13                       585
#define ICDBK0CON                     586
#define BKHLT                         587
#define BKEN                          588
#define ICDBK0L                       589
#define BKA0                          590
#define BKA1                          591
#define BKA2                          592
#define BKA3                          593
#define BKA4                          594
#define BKA5                          595
#define BKA6                          596
#define BKA7                          597
#define ICDBK0H                       598
#define BKA8                          599
#define BKA9                          600
#define BKA10                         601
#define BKA11                         602
#define BKA12                         603
#define BKA13                         604
#define BKA14                         605
#define BSRICDSHAD                    606
#define BSR_ICDSHAD                   607
#define STATUS_SHAD                   608
#define C_SHAD                        609
#define DC_SHAD                       610
#define Z_SHAD                        611
#define WREG_SHAD                     612
#define BSR_SHAD                      613
#define PCLATH_SHAD                   614
#define FSR0L_SHAD                    615
#define FSR0H_SHAD                    616
#define FSR1L_SHAD                    617
#define FSR1H_SHAD                    618
#define STKPTR                        619
#define TOSL                          620
#define TOSH                          621

#endif // _PIC16LF1554_H_
